blueskycoco/rt-thread/bsp/tm4c129x/libraries/usblib/device/usbdbulk.c
    ASSERT(pvBulkDevice != 0);

    //
    // The bulk device structure pointer.
    //
    psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

    //
    // Get a pointer to the bulk device instance data pointer
    //
    psInst = &psBulkDevice->sPrivateData;
    //
    // Read out the current endpoint status.
    //
    ui32EPStatus = MAP_USBEndpointStatus(USB0_BASE, psInst->ui8OUTEndpoint);
	MAP_USBDevEndpointStatusClear(USB0_BASE, psInst->ui8OUTEndpoint,ui32EPStatus);
	
	//rt_kprintf("cur %d epstatus %x ui32Status %x ,dma status \n",*(int *)psBulkDevice->pvRxCBData, ui32EPStatus,ui32Status/*,USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8OUTDMA)*/);
    //
    // Handler for the bulk OUT data endpoint.
    //
    if(*(int *)(psBulkDevice->pvRxCBData)==0)
    {
    	/*usbbulk 0 just for param config*/
		if(ui32Status & (0x10000 << USBEPToIndex(psInst->ui8OUTEndpoint)))
   		{
			ProcessDataFromHost(pvBulkDevice,ui32Status);
		}

		if(ui32Status & (1 << USBEPToIndex(psInst->ui8INEndpoint)))
		{
			rt_sem_release(&(psInst->tx_sem));
		}
    }
	else
	{
	    if(ui32Status & (0x10000 << USBEPToIndex(psInst->ui8OUTEndpoint)))
		{

			if(ui32EPStatus & USB_DEV_RX_PKT_RDY)
    		{
    			//rt_kprintf("get %d rx int\n",*(int *)psBulkDevice->pvRxCBData);
    			rt_sem_release(&(rx_sem[*(int *)(psBulkDevice->pvRxCBData)]));
				#if 0
				ui32Size = USBEndpointDataAvail(psInst->ui32USBBase,psInst->ui8OUTEndpoint);
				
				//rt_kprintf("ui32Size %d\n",psInst->sBuffer.ui32Size);
				psInst->sBuffer.ui32Size=ui32Size;
				//
				// Configure the next DMA transfer.
				//
				USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8OUTDMA);
				
				USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8OUTDMA,psInst->sBuffer.pvData, ui32Size);
				psInst->ui32Flags=USBD_FLAG_DMA_IN;
				//rt_kprintf("get data %d outdma %d , endpoint %d\n",ui32Size,psInst->ui8OUTDMA,psInst->ui8OUTEndpoint);
				#endif
			}
		}
		else if((USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8OUTDMA) ==	USBLIBSTATUS_DMA_COMPLETE)&&psInst->ui32Flags == USBD_FLAG_DMA_IN)
		{
		    //	rt_kprintf("rcv data over\n");
			//USBEndpointDMADisable(USB0_BASE,
			//					  psInst->ui8OUTEndpoint, USB_EP_DEV_OUT);
			USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8OUTDMA);
			//rt_kprintf("rx %d dma done\n",*(int *)psBulkDevice->pvRxCBData);
			rt_sem_release(&(psInst->rx_sem));
			#if 0
			USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8OUTDMA);
			psInst->sBuffer.pfnRxCallback(psBulkDevice->pvRxCBData,psInst->sBuffer.pvData,psInst->sBuffer.ui32Size);
			//
			// Acknowledge that the data was read, this will not cause a bus
			// acknowledgment.
			//
			MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
			//
			// Inform the callback of the new data.
			//
			//rt_kprintf("recv data over\n");
			psInst->ui32Flags=0;
			#endif
		}
	    else if((USBLibDMAChannelStatus(psInst->psDMAInstance,psInst->ui8INDMA) ==	USBLIBSTATUS_DMA_COMPLETE)&&psInst->ui32Flags == USBD_FLAG_DMA_OUT)
	    {
		 	//
	    	// Handler for the bulk IN data endpoint.
	    	//
			USBLibDMAChannelDisable(psInst->psDMAInstance,psInst->ui8INDMA);
			rt_sem_release(&(psInst->tx_sem));
			psInst->ui32Flags=0;
	    }
	}
}

//*****************************************************************************
//
// Called by the USB stack whenever a configuration change occurs.
//
//*****************************************************************************
static void
HandleConfigChange(void *pvBulkDevice, uint32_t ui32Info)
{
    tBulkInstance *psInst;
    tUSBDBulkDevice *psBulkDevice;

    ASSERT(pvBulkDevice != 0);

    //
    // The bulk device structure pointer.
    //
    psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

    //
    // Get a pointer to the bulk device instance data pointer
    //
    psInst = &psBulkDevice->sPrivateData;
	if(*(int *)psBulkDevice->pvRxCBData!=0)
	{
		//
		// If the DMA channel has already been allocated then clear
		// that channel and prepare to possibly use a new one.
		//
		if(psInst->ui8OUTDMA != 0)
		{
			USBLibDMAChannelRelease(psInst->psDMAInstance,
									psInst->ui8OUTDMA);
		}

		//
		// Configure the DMA for the OUT endpoint.
		//
		psInst->ui8OUTDMA =
			USBLibDMAChannelAllocate(psInst->psDMAInstance,
									 psInst->ui8OUTEndpoint, 
									 DATA_OUT_EP_MAX_SIZE,
									 USB_DMA_EP_RX | USB_DMA_EP_DEVICE);

		USBLibDMAUnitSizeSet(psInst->psDMAInstance,
							 psInst->ui8OUTDMA, 32);

		USBLibDMAArbSizeSet(psInst->psDMAInstance,
							psInst->ui8OUTDMA, 16);
		if(psInst->ui8INDMA != 0)
		{
			USBLibDMAChannelRelease(psInst->psDMAInstance,
									psInst->ui8INDMA);
		}

		//
		// Configure the DMA for the OUT endpoint.
		//
		psInst->ui8INDMA =
			USBLibDMAChannelAllocate(psInst->psDMAInstance,
									 psInst->ui8INEndpoint, 
									 DATA_OUT_EP_MAX_SIZE,
									 USB_DMA_EP_TX | USB_DMA_EP_DEVICE);

		USBLibDMAUnitSizeSet(psInst->psDMAInstance,
							 psInst->ui8INDMA, 32);

		USBLibDMAArbSizeSet(psInst->psDMAInstance,
							psInst->ui8INDMA, 16);
		rt_kprintf("outdma %d,endpoint %d\n",psInst->ui8OUTDMA,psInst->ui8OUTEndpoint);
		rt_kprintf("indma %d,endpoint %d\n",psInst->ui8INDMA,psInst->ui8INEndpoint);
	}
    //
    // Set all our endpoints to idle state.
    //
    psInst->iBulkRxState = eBulkStateIdle;
    psInst->iBulkTxState = eBulkStateIdle;

    //
    // If we have a control callback, let the client know we are open for
    // business.
    //
    if(psBulkDevice->pfnRxCallback)
    {
        //
        // Pass the connected event to the client.
        //
        psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                                    USB_EVENT_CONNECTED, 0, (void *)0);
    }

    //
    // Remember that we are connected.
    //
    psInst->bConnected = true;
}

//*****************************************************************************
//
// Device instance specific handler.
//
//*****************************************************************************
static void
HandleDevice(void *pvBulkDevice, uint32_t ui32Request, void *pvRequestData)
{
    tBulkInstance *psInst;
    uint8_t *pui8Data;
    tUSBDBulkDevice *psBulkDevice;

    //
    // The bulk device structure pointer.
    //
    psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

    //
    // Get a pointer to the bulk device instance data pointer
    //
    psInst = &psBulkDevice->sPrivateData;

    //
    // Create the 8-bit array used by the events supported by the USB Bulk
    // class.
    //
    pui8Data = (uint8_t *)pvRequestData;

    switch(ui32Request)
    {
        //
        // This was an interface change event.
        //
        case USB_EVENT_COMP_IFACE_CHANGE:
        {
            psInst->ui8Interface = pui8Data[1];
            break;
        }

        //
        // This was an endpoint change event.
        //
        case USB_EVENT_COMP_EP_CHANGE:
        {
            //
            // Determine if this is an IN or OUT endpoint that has changed.
            //
            if(pui8Data[0] & USB_EP_DESC_IN)
            {
                psInst->ui8INEndpoint = IndexToUSBEP((pui8Data[1] & 0x7f));	
				if(*(int *)psBulkDevice->pvRxCBData!=0)
				{
	            	rt_kprintf("ep in change %d\n",pui8Data[1]);
	                
	                //
	                // If the DMA channel has already been allocated then clear
	                // that channel and prepare to possibly use a new one.
	                //
	                if(psInst->ui8INDMA != 0)
	                {
	                    USBLibDMAChannelRelease(psInst->psDMAInstance,
	                                            psInst->ui8INDMA);
	                }

	                //
	                // Allocate a DMA channel to the endpoint.
	                //
	                psInst->ui8INDMA =
	                    USBLibDMAChannelAllocate(psInst->psDMAInstance,
	                                             psInst->ui8INEndpoint,
	                                             DATA_OUT_EP_MAX_SIZE,
	                                             (USB_DMA_EP_TX |
	                                              USB_DMA_EP_DEVICE));

	                //
	                // Set the DMA individual transfer size.
	                //
	                USBLibDMAUnitSizeSet(psInst->psDMAInstance, psInst->ui8INDMA,
	                                     32);

	                //
	                // Set the DMA arbitration size.
	                //
	                USBLibDMAArbSizeSet(psInst->psDMAInstance, psInst->ui8INDMA,
	                                    16);
				}
            }
            else
            {
                //
                // Extract the new endpoint number.
                //
                psInst->ui8OUTEndpoint = IndexToUSBEP(pui8Data[1] & 0x7f);
				if(*(int *)psBulkDevice->pvRxCBData!=0)
				{					
	            	rt_kprintf("ep out change %d\n",pui8Data[1]);
	                //
	                // If the DMA channel has already been allocated then clear
	                // that channel and prepare to possibly use a new one.
	                //
	                if(psInst->ui8OUTDMA != 0)
	                {
	                    USBLibDMAChannelRelease(psInst->psDMAInstance,
	                                            psInst->ui8OUTDMA);
	                }

	                //
	                // Allocate a DMA channel to the endpoint.
	                //
	                psInst->ui8OUTDMA =
	                    USBLibDMAChannelAllocate(psInst->psDMAInstance,
	                                             psInst->ui8OUTEndpoint,
	                                             DATA_OUT_EP_MAX_SIZE,
	                                             (USB_DMA_EP_RX |
	                                              USB_DMA_EP_DEVICE));

	                //
	                // Set the DMA individual transfer size.
	                //
	                USBLibDMAUnitSizeSet(psInst->psDMAInstance, psInst->ui8OUTDMA,
	                                     32);

	                //
	                // Set the DMA arbitration size.
	                //
	                USBLibDMAArbSizeSet(psInst->psDMAInstance, psInst->ui8OUTDMA,
	                                    16);
				}
            }
            break;
        }
        case USB_EVENT_LPM_RESUME:
        {
            if(psBulkDevice->pfnRxCallback)
            {
                //
                // Pass the LPM resume event to the client.
                //
                psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                                            USB_EVENT_LPM_RESUME, 0,
                                            (void *)0);
            }
            break;
        }
        case USB_EVENT_LPM_SLEEP:
        {
            if(psBulkDevice->pfnRxCallback)
            {
                //
                // Pass the LPM sleep event to the client.
                //
                psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                                            USB_EVENT_LPM_SLEEP, 0, (void *)0);
            }
            break;
        }
        case USB_EVENT_LPM_ERROR:
        {
            if(psBulkDevice->pfnRxCallback)
            {
                //
                // Pass the LPM error event to the client.
                //
                psBulkDevice->pfnRxCallback(psBulkDevice->pvRxCBData,
                                            USB_EVENT_LPM_ERROR, 0, (void *)0);
            }
            break;
        }
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// disconnected from the host.
//
//*****************************************************************************
static void
HandleDisconnect(void *pvBulkDevice)
{
    tUSBDBulkDevice *psBulkDevice;
    tBulkInstance *psInst;

