blueskycoco/rt-thread/bsp/tm4c129x/libraries/usblib/device/usbdbulk.c
		if(i32Retcode!=-1)			
			rt_sem_take(&(psInst->tx_sem), RT_WAITING_FOREVER);
		else
			return -1;

	}
	else
	{
	
		//
		// Configure and DMA for the IN transfer.
		//	
		psInst->ui32Flags = USBD_FLAG_DMA_OUT;
		USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8INDMA);
		USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8INDMA,pvBuffer, ui32Size);
		
		//
		// Remember that a DMA is in progress.
		//		
		rt_sem_take(&(psInst->tx_sem), RT_WAITING_FOREVER);
	}
	return 0;
}
int32_t USBBulkRx(void *pvBulkDevice,void *pvBuffer)
{
	int32_t ui32Size=0;
	tBulkInstance *psInst;
    tUSBDBulkDevice *psBulkDevice;
	
	ASSERT(psBulkDevice != 0);
	
	ASSERT(pvBuffer);
	//
	// The audio device structure pointer.
	//
	psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

	//
	// Create a pointer to the audio instance data.
	//
	psInst = &psBulkDevice->sPrivateData;

	ui32Size = USBEndpointDataAvail(psInst->ui32USBBase,psInst->ui8OUTEndpoint);
	if(ui32Size>0)
	{
		pvBuffer=rt_malloc(ui32Size);
		//
		// Configure the next DMA transfer.
		//	
		psInst->ui32Flags=USBD_FLAG_DMA_IN;
		USBLibDMATransfer(psInst->psDMAInstance, psInst->ui8OUTDMA,pvBuffer, ui32Size);
		//rt_kprintf("to start %d dma %d\n",*(int *)psBulkDevice->pvRxCBData,ui32Size);
		USBLibDMAChannelEnable(psInst->psDMAInstance,psInst->ui8OUTDMA);	
		rt_sem_take(&(psInst->rx_sem), RT_WAITING_FOREVER);
	}
	return ui32Size;
}
void USBBulkAckHost(void *pvBulkDevice)
{
	tBulkInstance *psInst;
    tUSBDBulkDevice *psBulkDevice;
	
	ASSERT(psBulkDevice != 0);
	// The audio device structure pointer.
	//
	psBulkDevice = (tUSBDBulkDevice *)pvBulkDevice;

	//
	// Create a pointer to the audio instance data.
	//
	psInst = &psBulkDevice->sPrivateData;

	MAP_USBDevEndpointDataAck(USB0_BASE, psInst->ui8OUTEndpoint, 0);	
	psInst->ui32Flags=0;

}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
